# Minard

In [3]:
from datascience import *

In [41]:
minard = Table.read_table('data/minard.csv')

In [42]:
minard

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000
34.3      | 55.2     | Wixma       | Retreat   | 55000
32        | 54.6     | Smolensk    | Retreat   | 24000
30.4      | 54.4     | Orscha      | Retreat   | 20000
26.8      | 54.3     | Moiodexno   | Retreat   | 12000

In [12]:
minard.num_columns, minard.num_rows, minard.labels

(5, 8, ('Longitude', 'Latitude', 'City', 'Direction', 'Survivors'))

In [14]:
minard.column('Survivors')

array([145000, 140000, 127100, 100000,  55000,  24000,  20000,  12000])

In [16]:
minard.column('Survivors')[0], minard.column('Survivors').item(0)

(145000, 145000)

In [18]:
initial_size = minard.column('Survivors').item(0)
initial_size

145000

In [43]:
percentage_surviving = minard.column('Survivors') / initial_size
percentage_surviving

array([1.        , 0.96551724, 0.87655172, 0.68965517, 0.37931034,
       0.16551724, 0.13793103, 0.08275862])

In [44]:
minard_ext = minard.with_column('Percent surviving', percentage_surviving)
minard_ext.set_format('Percent surviving', PercentFormatter)
minard_ext

Longitude | Latitude | City        | Direction | Survivors | Percent surviving
32        | 54.8     | Smolensk    | Advance   | 145000    | 100.00%
33.2      | 54.9     | Dorogobouge | Advance   | 140000    | 96.55%
34.4      | 55.5     | Chjat       | Advance   | 127100    | 87.66%
37.6      | 55.8     | Moscou      | Advance   | 100000    | 68.97%
34.3      | 55.2     | Wixma       | Retreat   | 55000     | 37.93%
32        | 54.6     | Smolensk    | Retreat   | 24000     | 16.55%
30.4      | 54.4     | Orscha      | Retreat   | 20000     | 13.79%
26.8      | 54.3     | Moiodexno   | Retreat   | 12000     | 8.28%

# List

In [28]:
flowers = Table.read_table('data/flowers.csv')
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

In [32]:
a_flower = [5, 'morning glory', 'purple']
flowers.with_row(a_flower)

Petals | Name          | Color
8      | lotus         | pink
34     | sunflower     | yellow
5      | rose          | red
5      | morning glory | purple

# Take

In [35]:
flowers.select('Name')

Name
lotus
sunflower
rose

In [39]:
flowers.take((1, 0))

Petals | Name      | Color
34     | sunflower | yellow
8      | lotus     | pink

In [46]:
import numpy as np

In [47]:
minard.take(np.arange(0, 4))

Longitude | Latitude | City        | Direction | Survivors
32        | 54.8     | Smolensk    | Advance   | 145000
33.2      | 54.9     | Dorogobouge | Advance   | 140000
34.4      | 55.5     | Chjat       | Advance   | 127100
37.6      | 55.8     | Moscou      | Advance   | 100000

In [38]:
flowers

Petals | Name      | Color
8      | lotus     | pink
34     | sunflower | yellow
5      | rose      | red

# Where

In [49]:
nba = Table.read_table('data/nba_salaries.csv')
nba

PLAYER           | POSITION | TEAM          | 2015-2016 SALARY
Paul Millsap     | PF       | Atlanta Hawks | 18.6717
Al Horford       | C        | Atlanta Hawks | 12
Tiago Splitter   | C        | Atlanta Hawks | 9.75625
Jeff Teague      | PG       | Atlanta Hawks | 8
Kyle Korver      | SG       | Atlanta Hawks | 5.74648
Thabo Sefolosha  | SF       | Atlanta Hawks | 4
Mike Scott       | PF       | Atlanta Hawks | 3.33333
Kent Bazemore    | SF       | Atlanta Hawks | 2
Dennis Schroder  | PG       | Atlanta Hawks | 1.7634
Tim Hardaway Jr. | SG       | Atlanta Hawks | 1.30452
... (407 rows omitted)

In [52]:
nba.sort('2015-2016 SALARY', descending=True)

PLAYER          | POSITION | TEAM                  | 2015-2016 SALARY
Kobe Bryant     | SF       | Los Angeles Lakers    | 25
Joe Johnson     | SF       | Brooklyn Nets         | 24.8949
LeBron James    | SF       | Cleveland Cavaliers   | 22.9705
Carmelo Anthony | SF       | New York Knicks       | 22.875
Dwight Howard   | C        | Houston Rockets       | 22.3594
Chris Bosh      | PF       | Miami Heat            | 22.1927
Chris Paul      | PG       | Los Angeles Clippers  | 21.4687
Kevin Durant    | SF       | Oklahoma City Thunder | 20.1586
Derrick Rose    | PG       | Chicago Bulls         | 20.0931
Dwyane Wade     | SG       | Miami Heat            | 20
... (407 rows omitted)

In [53]:
nba = nba.relabeled('2015-2016 SALARY', 'SALARY')

In [54]:
nba.where('SALARY', are.above(10))

PLAYER         | POSITION | TEAM              | SALARY
Paul Millsap   | PF       | Atlanta Hawks     | 18.6717
Al Horford     | C        | Atlanta Hawks     | 12
Joe Johnson    | SF       | Brooklyn Nets     | 24.8949
Thaddeus Young | PF       | Brooklyn Nets     | 11.236
Al Jefferson   | C        | Charlotte Hornets | 13.5
Nicolas Batum  | SG       | Charlotte Hornets | 13.1253
Kemba Walker   | PG       | Charlotte Hornets | 12
Derrick Rose   | PG       | Chicago Bulls     | 20.0931
Jimmy Butler   | SG       | Chicago Bulls     | 16.4075
Joakim Noah    | C        | Chicago Bulls     | 13.4
... (59 rows omitted)

In [55]:
nba.where('SALARY', are.between(10, 11))

PLAYER          | POSITION | TEAM                 | SALARY
Brendan Haywood | C        | Cleveland Cavaliers  | 10.5225
Wilson Chandler | SF       | Denver Nuggets       | 10.4494
Monta Ellis     | SG       | Indiana Pacers       | 10.3
Luol Deng       | SF       | Miami Heat           | 10.1516
Tyreke Evans    | SG       | New Orleans Pelicans | 10.7346
Jrue Holiday    | PG       | New Orleans Pelicans | 10.5955
Gerald Wallace  | SF       | Philadelphia 76ers   | 10.1059
Danny Green     | SG       | San Antonio Spurs    | 10
DeMar DeRozan   | SG       | Toronto Raptors      | 10.05

In [56]:
nba.where('TEAM', are.equal_to('Toronto Raptors'))

PLAYER            | POSITION | TEAM            | SALARY
DeMarre Carroll   | SF       | Toronto Raptors | 13.6
Kyle Lowry        | PG       | Toronto Raptors | 12
DeMar DeRozan     | SG       | Toronto Raptors | 10.05
Cory Joseph       | PG       | Toronto Raptors | 7
Patrick Patterson | PF       | Toronto Raptors | 6.26867
Jonas Valanciunas | C        | Toronto Raptors | 4.66048
Terrence Ross     | SF       | Toronto Raptors | 3.55392
Luis Scola        | PF       | Toronto Raptors | 2.9
Bismack Biyombo   | C        | Toronto Raptors | 2.814
Luke Ridnour      | PG       | Toronto Raptors | 2.75
... (7 rows omitted)

In [57]:
nba.where('TEAM', 'Toronto Raptors')

PLAYER            | POSITION | TEAM            | SALARY
DeMarre Carroll   | SF       | Toronto Raptors | 13.6
Kyle Lowry        | PG       | Toronto Raptors | 12
DeMar DeRozan     | SG       | Toronto Raptors | 10.05
Cory Joseph       | PG       | Toronto Raptors | 7
Patrick Patterson | PF       | Toronto Raptors | 6.26867
Jonas Valanciunas | C        | Toronto Raptors | 4.66048
Terrence Ross     | SF       | Toronto Raptors | 3.55392
Luis Scola        | PF       | Toronto Raptors | 2.9
Bismack Biyombo   | C        | Toronto Raptors | 2.814
Luke Ridnour      | PG       | Toronto Raptors | 2.75
... (7 rows omitted)

In [58]:
nba.where('PLAYER', are.containing('all'))

PLAYER            | POSITION | TEAM               | SALARY
Danilo Gallinari  | SF       | Denver Nuggets     | 14
Langston Galloway | SG       | New York Knicks    | 0.845059
Gerald Wallace    | SF       | Philadelphia 76ers | 10.1059
Kendall Marshall  | PG       | Philadelphia 76ers | 2.14477
Ray McCallum      | PG       | San Antonio Spurs  | 0.947276
John Wall         | PG       | Washington Wizards | 15.852